bench/results/scaling-nodelay-20260427-040600/hyper-c32.h2load.txt
starting benchmark...
spawning thread #0: 8 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 8 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 8 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 8 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #1.
Warm-up started for thread #0.
Warm-up started for thread #2.
progress: 12% of clients started
progress: 25% of clients started
progress: 37% of clients started
progress: 50% of clients started
progress: 62% of clients started
progress: 75% of clients started
progress: 87% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Main benchmark duration is over for thread #Main benchmark duration is over for thread #1. Stopping all clients.0. Stopping all clients.

Stopped all clients for thread #1
Stopped all clients for thread #0
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 9.00s, 809915.50 req/s, 20.08MB/s
requests: 6479324 total, 6479324 started, 6479324 done, 6479324 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 6479324 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 160.66MB (168468312) total, 41.63MB (43651192) headers (space savings 89.65%), 13.87MB (14547934) data
                     min         max         mean         sd        +/- sd
time for request:       21us     58.29ms      3.88ms      6.18ms    92.24%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   23392.08    27029.47    25308.94      819.99    68.75%