bench/results/scaling-nodelay-20260427-040600/hyper-c4.h2load.txt
starting benchmark...
spawning thread #0: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #1.
Warm-up started for thread #2.
Warm-up started for thread #0.
progress: 100% of clients started
Warm-up started for thread #3.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 9.00s, 46015.50 req/s, 1.14MB/s
requests: 368124 total, 368124 started, 368124 done, 368124 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 368126 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.13MB (9571990) total, 2.35MB (2468504) headers (space savings 89.65%), 803.24KB (822516) data
                     min         max         mean         sd        +/- sd
time for request:       27us     43.10ms      8.65ms     16.11ms    80.20%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   11344.46    11661.39    11502.76      143.93    50.00%