bench/results/scaling-nodelay-20260427-040600/trillium-mop-c32.h2load.txt
starting benchmark...
spawning thread #0: 8 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 8 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 8 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 8 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #1.
Warm-up started for thread #3.
Warm-up started for thread #2.
progress: 12% of clients started
progress: 25% of clients started
progress: 37% of clients started
progress: 50% of clients started
progress: 62% of clients started
progress: 75% of clients started
progress: 87% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1

finished in 9.00s, 380888.88 req/s, 33.78MB/s
requests: 3047111 total, 3047111 started, 3047111 done, 3047111 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3047111 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 270.25MB (283381323) total, 208.87MB (219015616) headers (space savings 40.74%), 6.53MB (6844238) data
                     min         max         mean         sd        +/- sd
time for request:       25us     83.69ms      8.30ms     12.46ms    80.06%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   10801.16    13057.89    11902.26      627.36    59.38%