bench/results/scaling-nodelay-20260427-040600/trillium-mop-c4.h2load.txt
starting benchmark...
spawning thread #0: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #1.
Warm-up started for thread #3.
Warm-up started for thread #0.
Warm-up started for thread #2.
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 438622.38 req/s, 38.90MB/s
requests: 3508979 total, 3508979 started, 3508979 done, 3508979 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3508979 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 311.22MB (326335047) total, 240.96MB (252664256) headers (space savings 40.74%), 7.53MB (7895758) data
                     min         max         mean         sd        +/- sd
time for request:       32us     14.71ms       831us       293us    71.78%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :  109228.90   110031.08   109652.14      346.36    50.00%