bench/results/scaling-nodelay-20260427-040600/trillium-mop-c8.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #1.
Warm-up started for thread #0.
Warm-up started for thread #2.
progress: 50% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 9.00s, 434351.88 req/s, 38.52MB/s
requests: 3474815 total, 3474815 started, 3474815 done, 3474815 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3474815 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 308.19MB (323157795) total, 238.53MB (250119936) headers (space savings 40.74%), 7.45MB (7816248) data
                     min         max         mean         sd        +/- sd
time for request:       28us      8.44ms      1.74ms       913us    73.53%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   53753.12    54877.13    54291.63      413.02    50.00%